Simple Blog App/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if (@post.update(post_params)) #save post params
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "this is an updated post"], ["body", "updated my post"], ["updated_at", "2018-02-28 23:48:26.756301"], ["id", 1]]

  def create
    #render plain: params[:post].inspect submits to create
    @post = Post.new(post_params)
    if (@post.save) #save post params
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ttesss"], ["body", "fdsgdsgds"], ["created_at", "2018-02-28 22:30:47.914968"], ["updated_at", "2018-02-28 22:30:47.914968"]]